---
kind: other
id: Properties.T:Autodesk.Revit.UI.ExternalApplicationArray
source: html/190f8e52-86d0-5378-4532-a968a8bd5cc7.htm
---
# ExternalApplicationArray Properties

Test to see if the array is empty.